#ifndef  AC_XELE_MD_H
#define  AC_XELE_MD_H

#include "ac_xele_md_struct.h"

//==================================================================
// 函数名: AcXeleMDInit
// 作者: AcceleCom
// 日期: 2015-04-30
// 功能: 接口初始化
// 输入参数: 无
// 输出参数: 无
// 返回值: true: 成功, false: 失败
// 修改记录:
//==================================================================
bool AcXeleMDInit();

//==================================================================
// 函数名: AcXeleMDCount
// 作者: AcceleCom
// 日期: 2015-4-30
// 功能: 查询当前行情数量
// 输入参数: 无
// 输出参数: 无
// 返回值: MD数据个数
// 修改记录:
//==================================================================
int AcXeleMDCount();

//==================================================================
// 函数名: AcXeleMD
// 作者: AcceleCom
// 日期: 2015-04-30
// 功能: 获取MD数据首地址market_data，根据AcXeleMDCount()得到的数据个数N
//      来获取最新的行情数据指针market_data + N
// 输入参数:
// 输出参数:
// 返回值: MD数据首地址
// 修改记录:
//==================================================================
const DepthMarketDataField *AcXeleMDData();

//==================================================================
// 函数名: AcXeleMDVersion
// 作者: AcceleCom
// 日期: 2015-04-30
// 功能: 获取当前API版本号
// 输入参数: 无
// 输出参数: 无
// 返回值: 当前API版本号
//==================================================================
const  char *AcXeleMDVersion();

#endif //  AC_XELE_MD_H
